# DistanceBetweenBarsWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..DistanceBetweenBarsWarning Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
This is used to post warning. The distance between the connected ends of the bars exceeds 10 bar diameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DistanceBetweenBarsWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DistanceBetweenBarsWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DistanceBetweenBarsWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace